---
title: MathComparisonUtils
classe: Autodesk.Revit.DB.MathComparisonUtils
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# MathComparisonUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsAlmostEqual(Double, Double)` | `MathComparisonUtils.IsAlmostEqual(value1, value2)` | Boolean |
| `Boolean IsAlmostZero(Double)` | `MathComparisonUtils.IsAlmostZero(value)` | Boolean |
| `Boolean IsGreaterThan(Double, Double)` | `MathComparisonUtils.IsGreaterThan(value1, value2)` | Boolean |
| `Boolean IsGreaterThanOrAlmostEqual(Double, Double)` | `MathComparisonUtils.IsGreaterThanOrAlmostEqual(value1, value2)` | Boolean |
| `Boolean IsLessThan(Double, Double)` | `MathComparisonUtils.IsLessThan(value1, value2)` | Boolean |
| `Boolean IsLessThanOrAlmostEqual(Double, Double)` | `MathComparisonUtils.IsLessThanOrAlmostEqual(value1, value2)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```